Revit 2026 API

# LocationCurveCurve Property

---

Provides the ability to get and set the curve of a curve based element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Curve Curve { get; set; }
```
```vb
Public Property Curve As Curve
	Get
	Set
```
```cpp
public:
property Curve^ Curve {
	Curve^ get ();
	void set (Curve^ value);
}
```
```fsharp
member Curve : Curve with get, set
```

#### Property Value

Curve

This property can be used to set the location of curve based element to any desired position. Many elements are curve based. Some examples are walls, beams and braces.

#### Reference

LocationCurve Class

Autodesk.Revit.DB Namespace